[{"sod":[{"name":"Lazlo","star":"Tenkai","howToRecruit":"You control the Hero from the beginning of the game. You will be able to assign him a name at the beginning of the game."},{"name":"Keneth","star":"Tensyo","howToRecruit":"Before starting on your first mission, you can choose two of the four Razril Knights. If you choose Keneth he will join. If not, Keneth will join automatically when liberating Razril."},{"name":"Tal","star":"Tenyu","howToRecruit":"Before starting on your first mission, you can choose two of the four Razril Knights. If you choose Tal he will join. If not, Tal will join automatically when liberating Razril."},{"name":"Chiepoo","star":"Tenfu","howToRecruit":"Joins automatically after the Hero is banished from Gaien."},{"name":"Desmond","star":"Chisu","howToRecruit":"Joins automatically after acquiring your headquarters."},{"name":"Louise","star":"Chiin","howToRecruit":"Joins automatically after acquiring your headquarters."},{"name":"Chadli","star":"Chikou","howToRecruit":"Joins automatically after acquiring your headquarters."},{"name":"Tov","star":"Chiman","howToRecruit":"Joins automatically after acquiring your headquarters."},{"name":"Ornan","star":"Chihi","howToRecruit":"After the King of Obel requests new recruits, speak with Ornan near the armor shop in Obel. Important Notice: Ornan cannot be recruited after your headquarters is launched into the sea."},{"name":"Perrault","star":"Chiyou","howToRecruit":"After the King of Obel requests new recruits, speak with Perrault at the trading shop in the Nay Island Kobold Settlement."},{"name":"Mitsuba","star":"Chiin","howToRecruit":"After the King of Obel requests new recruits, speak with Mitsuba at the town square in Na-Nal and defeat her in a duel."},{"name":"Reinhold","star":"Chibaku","howToRecruit":"Joins with Mitsuba."},{"name":"Rita","star":"Chikei","howToRecruit":"After the King of Obel requests new recruits, speak with Rita at the Inn in Na-Nal and reduce her points to 3,000 or less in Ritapon."},{"name":"Rakgi","star":"Tenrou","howToRecruit":"Joins automatically after the second Guard is defeated in the Obel Ruins."},{"name":"Rikie","star":"Tensui","howToRecruit":"Joins automatically after the second Guard is defeated in the Obel Ruins."},{"name":"Lilin","star":"Chisatsu","howToRecruit":"Joins automatically after the battle with the mermaid poacher ship."},{"name":"Cedric","star":"Tensoku","howToRecruit":"After the battle with the mermaid poacher ship, visit the Inn at Obel and view the scene with Cedric. Speak with the woman near the Inn and then return to your headquarters. Once you arrive, speak with Louise.\nImportant Notice: Cedric cannot be recruited after your headquarters is launched into the sea."},{"name":"Oleg","star":"Chima","howToRecruit":"Joins automatically after speaking to him by the request of Desmond."},{"name":"Akaghi","star":"Chikou","howToRecruit":"Joins automatically after defeating him in battle."},{"name":"Mizuki","star":"Chikyou","howToRecruit":"Joins automatically after defeating her in battle."},{"name":"Ramada","star":"Tenritsu","howToRecruit":"Joins automatically after defeating Akaghi and Mizuki in battle."},{"name":"Yu","star":"Chirei","howToRecruit":"After the King of Obel orders you to evacuate the citizens of the town, speak with Yu beside the appraisal shop in Obel.\nNote: Yu must be recruited in order to proceed with the evacuation (He does not automatically join though, you must find him)."},{"name":"Adrienne","star":"Chiko","howToRecruit":"After the King of Obel orders you to evacuate the citizens of the town, speak with her near the trading shop in Obel. If you do not recruit her during the evacuation, you can find her in Middleport and give her a Hammer (you may need to give the Silver Hammer)."},{"name":"Haruto","star":"Chimou","howToRecruit":"Joins automatically after your headquarters is launched into the sea."},{"name":"Lino","star":"Tengou","howToRecruit":"Joins automatically after your headquarters is launched into the sea."},{"name":"Nico","star":"Chisin","howToRecruit":"Joins automatically after your headquarters is launched into the sea."},{"name":"Pablo","star":"Chiziku","howToRecruit":"Joins automatically after your headquarters is launched into the sea."},{"name":"Mao","star":"Chitou","howToRecruit":"After your headquarters is launched into the sea, rest in your room and then exit to enter a conversation with Tov. Enter the room across from Reinhold's training room."},{"name":"Nao","star":"Chisyun","howToRecruit":"After some time has passed after recruiting Mao, rest in your room and then exit to enter a conversation with Tov once again. Enter the room across from Reinhold's training room."},{"name":"Bang","star":"Chikai","howToRecruit":"After your headquarters is launched into the sea, speak with him at the raffle shop in the Nay Island Kobold Settlement."},{"name":"Bartholomew","star":"Chikyou","howToRecruit":"After your headquarter is launched into the sea, observe Perrault's first volume of the newspaper and read about Bartholomew. Visit the house south of the hotsprings in the Nay Island Kobold Settlement and speak with Bartholomew."},{"name":"Viki","star":"Chitatsu","howToRecruit":"After your headquarters is launched into the sea, make your way towards the Nay Island Kobold Settlement. Before crossing the bridge that leads there, a scene with Viki will occur. Continue onward until you reach the Kobold Settlement and then return to the location where Viki appeared earlier. "},{"name":"Jeane","star":"Chiketsu","howToRecruit":"After your headquarters is launched into the sea, return to Na-Nal and speak with the man beside the hotsprings and the man beside the armor shop. Visit the rune shop and inquire about the famous rune mistress."},{"name":"Manu","star":"Chisou","howToRecruit":"After your headquarters is launched into the sea, speak with Manu at the inn in Na-Nal."},{"name":"Ugetsu","star":"Tenson","howToRecruit":"After your headquarters is launched into the sea, return to Na-Nal and speak with him beside the trading shop.\nNote: Ugetsu appears randomly. Repeatedly leave Na-Nal and return until he shows up. He seems to appear automatically after recruiting Rita."},{"name":"Shiramine","star":"Tenhei","howToRecruit":"After recruiting Ugetsu, return to your headquarters and speak with him."},{"name":"Lilan","star":"Chii","howToRecruit":"After recruiting Shiramine, have him lower the net and sail between Na-Nal and Nay Island until Lilan is captured."},{"name":"Izak","star":"Tenyu","howToRecruit":"After your headquarters is launched into the sea, speak with Izak in Iluya and then give him a flower seed.\nFlower seeds can be purchased at the trading shop in Middleport and the Nay Island Kobold Settlement."},{"name":"Kate","star":"Chisoku","howToRecruit":"After your headquarters is launched into the sea, speak with Kate at the town square in Iluya with Mizuki in your group."},{"name":"Nataly","star":"Chiri","howToRecruit":"After your headquarters is launched into the sea, speak with Nataly in Iluya."},{"name":"Taisuke","star":"Chiretsu","howToRecruit":"After your headquarters is launched into the sea, return to the Deserted Island cavern and speak with Taisuke. After speaking with him, attempt to leave; he will eventually request that you bring over his clothes. After doing this, leave the cavern and then return to speak with Taisuke once more."},{"name":"Lilen","star":"Chiyu","howToRecruit":"After recruiting Taisuke, visit the Deserted Island cavern and speak with Lilen."},{"name":"Rene","star":"Chikou","howToRecruit":"After your headquarters is launched into the sea, return to Nay Island and find the message bottle on the beach. Visit Donut Island and give the message bottle to Rene."},{"name":"Phil","star":"Chisui","howToRecruit":"After acquiring 42 Stars of Destiny, speak with Phil beside the inn at the Nest of Pirates."},{"name":"Dario","star":"Chibi","howToRecruit":"Joins automatically after forming an alliance with the pirates."},{"name":"Hervey","star":"Chimou","howToRecruit":"Joins automatically after forming an alliance with the pirates."},{"name":"Kika","star":"Tenko","howToRecruit":"Joins automatically after forming an alliance with the pirates."},{"name":"Nalleo","star":"Chiken","howToRecruit":"Joins automatically after forming an alliance with the pirates."},{"name":"Sigurd","star":"Chiki","howToRecruit":"Joins automatically after forming an alliance with the pirates."},{"name":"Lilon","star":"Chiyu","howToRecruit":"After the events with Snowe in Razril, speak with the man near the blacksmith at the Nest of Pirates. Leave the Nest of Pirates using your ship and sail around the entrance until Lilon calls out to you."},{"name":"Liloon","star":"Chisa","howToRecruit":"After recruiting Lilan, Lilen, Lilin and Lilon, speak with Liloon at the harbor in Iluya."},{"name":"Agnes","star":"Chifuku","howToRecruit":"Joins automatically after naming your army and ship."},{"name":"Elenor Silverberg","star":"Tenki","howToRecruit":"Joins automatically after naming your army and ship."},{"name":"Brec","star":"Tenkoku","howToRecruit":"Joins with Jango."},{"name":"Jango","star":"Tenbou","howToRecruit":"After naming your army and ship and after acquiring 51 Stars of Destiny, return to your room."},{"name":"Aldo","star":"Tenei","howToRecruit":"After naming your army and ship, return to the Hermitage Island and speak with Aldo behind Elenor's house."},{"name":"Gau","star":"Tensatsu","howToRecruit":"After naming your army and ship, return to the Hermitage Island and wander around the forest in front of Elenor's house. Gau will eventually appear as a random encounter and will need to be defeated."},{"name":"Katarina Cott","star":"Tenjyu","howToRecruit":"After naming your army and ship, speak with Katarina in Kika's bedroom at the Nest of Pirates."},{"name":"Lo Fong","star":"Tenzai","howToRecruit":"Joins with Lo Seng."},{"name":"Lo Hak","star":"Tenpai","howToRecruit":"Joins with Lo Seng."},{"name":"Lo Seng","star":"Tenken","howToRecruit":"After naming your army and ship, enter the hotsprings in Mordo Island. Refuse to pay 10,000 potch and then defeat Lo Seng, Lo Fong and Lo Hak in a battle."},{"name":"Igor","star":"Chido","howToRecruit":"After recruiting Lo Seng, Lo Fong and Lo Hak, speak with Igor beside the hotsprings in Mordo Island."},{"name":"Champo","star":"Chikaku","howToRecruit":"Joins with Nalkul.\nImportant Notice: Champo cannot be recruited after liberating Obel."},{"name":"Nalkul","star":"Chitan","howToRecruit":"After naming your army and ship, return to Nay Island with Chiepoo in your group. Visit the trading shop in the Nay Island Kobold Settlement and then leave the town. Upon crossing the bridge that leads to Nay Island, a scene with Nalkul and Champo will occur. Return to the Kobold Settlement and find the duo beside the locked house.\nImportant Notice: Nalkul cannot be recruited after liberating Obel."},{"name":"Micky","star":"Chibun","howToRecruit":"Joins with Schtolteheim Reinbach III."},{"name":"Schtolteheim Reinbach III","star":"Tenki","howToRecruit":"After making an alliance with Middleport, Reinbach will approach you at the harbor in Middleport; he will request that you bring him a Rose Crest. Acquire the Rose Crest from Gareth at the inn in Nay Island and then deliver it to Reinbach."},{"name":"Gareth","star":"Chiyu","howToRecruit":"After recruiting Reinbach, speak with Gareth at the inn in Nay Island with Reinbach in your group."},{"name":"Etienne","star":"Chiraku","howToRecruit":"After recruiting Reinbach, speak with Etienne outside Reinbach's manor in Middleport with Reinbach in your group."},{"name":"Deborah","star":"Chiyu","howToRecruit":"After making an alliance with Middleport, speak with Deborah at the inn in Middleport."},{"name":"Oskar","star":"Chizoku","howToRecruit":"Joins with Deborah."},{"name":"Helga","star":"Tenku","howToRecruit":"After making an alliance with Middleport, speak with the man staying at the inn in Nay Island. Return to Middleport and speak with Helga at the inn."},{"name":"Charlemagne","star":"Chichin","howToRecruit":"After recruiting Helga, speak with Charlemagne at the inn in Middleport. Leave the town and then immediately return to speak with Charlemagne again. Leave the town again and then immediately return to speak with Charlemagne once more."},{"name":"Keen","star":"Teni","howToRecruit":"After defeating the Moving Island, speak with Keen beside the trading shop in Middleport with Sigurd in your group. Remove Sigurd from your group and then speak with Keen again; pay him the 10,000 potch he wants. Declining once will drop the asking price by one potch."},{"name":"Ted","star":"Tenkai","howToRecruit":"After acquiring 71 Stars of Destiny, return to the war room in your headquarters. Upon doing so, a fog ship will appear nearby. Complete the event that takes place on the ship.\nNote: If you leave the fog ship before completing the quest, the ship can still be found somewhere on the world map.\nImportant Notice: Ted cannot be recruited after liberating Obel."},{"name":"Axel","star":"Tenmou","howToRecruit":"Joins automatically after liberating Na-Nal."},{"name":"Eugene","star":"Chisyu","howToRecruit":"After liberating Na-Nal, speak with Eugene outside the inn in Na-Nal."},{"name":"Selma","star":"Teni","howToRecruit":"After liberating Na-Nal, speak with Selma at the harbor in Na-Nal."},{"name":"Kevin","star":"Chikei","howToRecruit":"Joins automatically after making an alliance with Nay Island."},{"name":"Pam","star":"Chisou","howToRecruit":"Joins automatically after making an alliance with Nay Island."},{"name":"Millay","star":"Chikyu","howToRecruit":"After making an alliance with Nay Island, speak with the man beside the trading shop in Middleport. Return to Na-Nal with Reinbach in your group and defeat the scoundrels at the harbor."},{"name":"Jeremy","star":"Chisatsu","howToRecruit":"After receiving the orders to liberate Razril, speak with Jeremy at the town square in Na-Nal with Mitsuba in your group."},{"name":"Helmut","star":"Chian","howToRecruit":"If your \"forgiveness level\" is high enough (which can be affected by judging in Confession sessions), you can tell him to join your forces after defeating his fleet."},{"name":"Jewel","star":"Tentai","howToRecruit":"Before starting on your first mission, you can choose two of the four Razril Knights. If you choose Jewel she will join. If not, Jewel will join automatically when liberating Razril."},{"name":"Paula","star":"Tenman","howToRecruit":"Before starting on your first mission, you can choose two of the four Razril Knights. If you choose Paula she will join. If not, Paula will join automatically when liberating Razril."},{"name":"Basil (SIV)","star":"Chison","howToRecruit":"After liberating Razril, speak with Basil at the town square in Razril."},{"name":"Konrad","star":"Tenkyu","howToRecruit":"After liberating Razril, speak with Konrad at the inn in Razril with Katarina in your group."},{"name":"Maxine","star":"Chihei","howToRecruit":"Speak with Maxine at the town square of Na-Nal and defeat her in battle. Then speak with her at Stonecutter's Field and defeat her in battle. Then speak with her once more at the inn in Razril after liberating Razril."},{"name":"Frederica","star":"Chikatsu","howToRecruit":"After defeating Helmut's fleet during the sunset in Razril, speak with Frederica at the item shop."},{"name":"Funghi","star":"Chisyu","howToRecruit":"After defeating Helmut's fleet during the sunset in Razril, speak with Funghi at the kitchen in the Hall of Knights."},{"name":"Ameria","star":"Chimei","howToRecruit":"After Razril's sunset scene, speak with Ameria at the top of the tower in the Hall of Knights."},{"name":"Gretchen","star":"Tenbi","howToRecruit":"After Razril's sunset scene, speak with Gretchen beside the armor shop in Razril."},{"name":"Karl","star":"Chiaku","howToRecruit":"After Razril's sunset scene, spend the night at the inn in Razril and then speak with Karl in the back streets."},{"name":"Warlock","star":"Chizen","howToRecruit":"After liberating Razril, speak with Pablo and then visit the abandoned house in Middleport. Search the opened treasure chest and select \"24\". Enter the dungeon that opens up and defeat the boss at the end."},{"name":"Pecola","star":"Chizou","howToRecruit":"After recruiting Warlock, speak with the woman beside the inn in Middleport to receive an Interior Book. Then visit the abandoned house there. "},{"name":"Tanya","star":"Chikai","howToRecruit":"After liberating Razril, speak with Tanya at the entrance of the Nest of Pirates."},{"name":"Flare","star":"Tenkou","howToRecruit":"Joins automatically after liberating Obel."},{"name":"Setsu","star":"Chizen","howToRecruit":"Joins automatically after liberating Obel."},{"name":"Carrie","star":"Chijyu","howToRecruit":"After liberating Obel, speak with Carrie above the appraisal shop/trading shop in Obel."},{"name":"Ema","star":"Chiei","howToRecruit":"Joins with Gary."},{"name":"Gary","star":"Chii","howToRecruit":"After liberating Obel, speak with Gary beside Obel Palace."},{"name":"Gunter","star":"Chisyu","howToRecruit":"Speak with Gunter in Middleport near the beginning of the game and later just after [Na Nal]'s liberation. After liberating Obel, speak with Gunter near the rune shop in Obel."},{"name":"Nabokov","star":"Chisei","howToRecruit":"After liberating Obel, speak with Nabokov at the appraisal shop in Obel and allow him to join."},{"name":"Noah","star":"Chiku","howToRecruit":"After liberating Obel, speak with Noah in the throne room of Obel Palace and answer her question three times."},{"name":"Trishtan","star":"Chihi","howToRecruit":"After liberating Obel, speak with Trishtan at the inn in Obel with Yu in your group."},{"name":"Wendel","star":"Chitai","howToRecruit":"After liberating Obel, speak with Nico and then speak with Wendel at the harbor in Obel."},{"name":"Rachel","star":"Tenyu","howToRecruit":"After liberating Obel, speak with Rachel in the cave where your headquarters used to be. Cedric must be in the group and you must agree to pay off Cedric's debt."},{"name":"Travis","star":"Tensyo","howToRecruit":"After liberating Obel, speak with Travis at the Obel Ruins. Use a Scroll of Return and then speak with Travis once more."},{"name":"Snowe Vingerhut","star":"Tenan","howToRecruit":"In order to recruit Snowe, you must do the following after liberating Obel:\n1. If you have scene the a cutscene involving Ramada's bird by visiting the ship's deck, DO NOT enter the War Room. Once you trigger the War Room scene, it will be too late to activate (3).\n2. Recruit all other 107 Stars of Destiny.\n3. Visit Mordo Island and speak with the man who gives trading tips in front of the bathhouse, he should mention seeing a body drifting out in the ocean. Then sail west from Mordo Island until a cutscene activates.\n4. Ask Snowe to join. Note that your \"forgiveness level\" (influenced by your judgements in Confession sessions) may affect the ability to recruit him."}]},{"guides":[{"name":"Antiques Listing","description":"The locations and prices of the various pots, paintings, and ornaments.","author":"Antiques Listing by Kuromimi","url":"/games/gs1/guides/antiques.php"},{"name":"Armor List","description":"A full list with all pieces of armor, along with their corresponding classes and sources.","author":"Armor List by Celes","url":"/games/gs1/guides/armor.php"},{"name":"Army Battles Guide","description":"All of the battle groupings and each character's attacking and death quotes are listed here.","author":"Army Battles Guide by Shirofan","url":"/games/gs1/guides/armybattles.php"},{"name":"Bath Guide","description":"A guide to the hidden scenes in the Bath, along with each of the individual baths and the ornaments used to decorate them.","author":"Bath Guide by Celes","url":"/games/gs1/guides/bath.php"},{"name":"Bestiary","description":"The bestiary is a listing of where all of the enemies in the game can be found, their stats, attributes and their dropped items.","author":"Bestiary by Celes","url":"/games/gs1/guides/bestiary.php"},{"name":"Duel Guide","description":"The duel guide is a list of what the characters you are duelling might say, and the actions that they will perform.","author":"Duel Guide by Raww Le Klueze / Celes","url":"/games/gs1/guides/duel.php"},{"name":"Endings Guide","description":"Complete list of all possible ending lines for all characters.","author":"Endings Guide by Celes","url":"/games/gs1/guides/endings.php"},{"name":"Initial Equipment List","description":"A list covering starting levels for all characters on recruitment, as well as initial equipment, runes and items right from the start.","author":"Initial Equipment List by Celes","url":"/games/gs1/guides/initial.php"},{"name":"Magic Points Guide","description":"A list of how high a characters' Magic stat has to be before they receive more MP.","author":"Magic Points Guide by KoRnholio / Celes","url":"/games/gs1/guides/mp.php"},{"name":"Miscellaneous Items Listing","description":"The locations and prices of the various items not classified as antiques or armor.","author":"Miscellaneous Items Listing by Kuromimi","url":"/games/gs1/guides/miscitems.php"},{"name":"Missables List","description":"This list includes all characters and items, that can be missed forever and cannot be obtained at a later time or by a second chance. It should be interesting for collecting issues/perfect files.","author":"Missables List by Celes","url":"/games/gs1/guides/missable.php"},{"name":"Old Books Guide","description":"Complete texts of all the Old Books and where they can be found in the game.","author":"Old Books Guide by Raww Le Klueze / Celes","url":"/games/gs1/guides/oldbooks.php"},{"name":"Runes List","description":"An exhaustive database of all available runes in the game. This guide also makes note of any non-playable runes mentioned in the game.","author":"Runes List by Celes","url":"/runes/?f=1&g=1&l=1"},{"name":"Stat Growth Charts","description":"Each playable character's possible statistics with each level they gain is listed here.","author":"Stat Growth Charts by Kuromimi and HowlingGuild","url":"/games/gs1/guides/statgrowth.php"},{"name":"Unites Guide","description":"This is a list of unites: their names, characters involved, and properties.","author":"Unites Guide by Punkaiser/Raww Le Klueze","url":"/games/gs1/guides/unites.php"},{"name":"Weapon Growth Guide","description":"The strengths and names of each weapon as you sharpen them.","author":"Weapon Growth Guide by KoRnholio","url":"/games/gs1/guides/wpngrowth.php"}]}]