[{"name":"Tir McDohl","star":"Tenkai","howToRecruit":"Joins automatically at the beginning of the story."},{"name":"Cleo","star":"Tenman","howToRecruit":"Joins automatically before receiving your first mission from Kraze."},{"name":"Gremio","star":"Tenei","howToRecruit":"Joins automatically before receiving your first mission from Kraze.\nSpoiler: Gremio dies at a certain point in the game. He is resurrected before the final major battle, if you have recruited all 107 other stars and kept them alive."},{"name":"Ted","star":"N/A","howToRecruit":"Joins automatically before receiving your first mission from Kraze.\nNote:. Permanantly leaves after your return from Rockland."},{"name":"Viktor","star":"Tenko","howToRecruit":"Joins automatically before escaping Gregminster."},{"name":"Odessa Silverberg","star":"N/A","howToRecruit":"Joins automatically on your mission to Sarady.\nNote:. Permanantly leaves after your return from Sarady."},{"name":"Mathiu Silverberg","star":"Tenki","howToRecruit":"Joins automatically after Tir agrees to become leader of the resistance."},{"name":"Camille","star":"Tenyu","howToRecruit":"Joins automatically after meeting Tai Ho."},{"name":"Tai Ho","star":"Tenhei","howToRecruit":"Joins automatically at the Toran Lake Fortress."},{"name":"Luc","star":"Tenkai","howToRecruit":"Joins automatically after taking the Toran Lake Fortress."},{"name":"Yam Koo","star":"Tenson","howToRecruit":"Joins automatically after taking the Toran Lake Fortress."},{"name":"Chandler","star":"Chikou","howToRecruit":"Speak to him at the Fortress of Kwaba after taking the Toran Lake Fortress."},{"name":"Kai","star":"Chihi","howToRecruit":"Speak to him at the Garan Fortress after taking the Toran Lake Fortress."},{"name":"Lorelai","star":"Chikatsu","howToRecruit":"Speak to her in the Inn at Kouan after taking the Toran Lake Fortress. Tir must be at least lv. 25."},{"name":"Maas","star":"Chibaku","howToRecruit":"Speak to him in the blacksmith at Great Forest Village after taking the Toran Lake Fortress."},{"name":"Marie","star":"Chiin","howToRecruit":"Speak to her in the Inn at Seika after taking the Toran Lake Fortress."},{"name":"Onil","star":"Chizen","howToRecruit":"Speak to her in her house at Seika after taking the Toran Lake Fortress."},{"name":"Sansuke","star":"Chiretsu","howToRecruit":"Speak to him in his house at Great Forest Village after taking the Toran Lake Fortress."},{"name":"Sergei","star":"Chisou","howToRecruit":"Speak to him in the Tavern at Kaku after taking the Toran Lake Fortress."},{"name":"Antonio","star":"Chisyu","howToRecruit":"Speak to him in the Inn at Seika anytime after recruitng Marie. Marie must have mentioned needing help with cooking. Repeatedly talk to her at the Inn at HQ until she does (you just talk to her a few times while choosing Don't Stay)."},{"name":"Rock","star":"Chison","howToRecruit":"Speak to him in the Vault in Lepant's mansion. Allow him to join."},{"name":"Juppo","star":"Chisyun","howToRecruit":"Join's you whether or not you speak with him!"},{"name":"Meg","star":"Chikei","howToRecruit":"Speak to her outside the Inn at Kaku with Juppo in your active party."},{"name":"Eileen","star":"Tenkou","howToRecruit":"Joins automatically after saving her from Kraze."},{"name":"Giovanni","star":"Chiyou","howToRecruit":"Joins automatically after saving Eileen from Kraze."},{"name":"Krin","star":"Chizoku","howToRecruit":"Joins automatically after saving Eileen from Kraze."},{"name":"Lepant","star":"Tengou","howToRecruit":"Joins automatically after saving Eileen from Kraze."},{"name":"Pahn","star":"Tentai","howToRecruit":"Speak to him in Kraze's Mansion after saving Eileen.\nSpoiler: Later in the game, Pahn will have to battle General Teo. If he is around level 30, has a level 10+ weapon, and is equipped with the best armor available, he can easily win. If he doesn't, he dies."},{"name":"Gaspar","star":"Chisyu","howToRecruit":"Speak to him in the tavern at Kaku with a level 2 castle. Win 5000 bits from him."},{"name":"Sydonia","star":"Tenkoku","howToRecruit":"Joins automatically after saving Eileen from Kraze."},{"name":"Varkas","star":"Tenbou","howToRecruit":"Joins automatically after saving Eileen from Kraze."},{"name":"Kirkis","star":"Tenbi","howToRecruit":"Joins automatically after agreeing to help him fight Kwanda Rossman's army."},{"name":"Sheena","star":"Chimei","howToRecruit":"Speak to him in the Inn at Seika with Lepant in your active party.\nCastle Level 2"},{"name":"Viki","star":"Chitatsu","howToRecruit":"Allow her to join the army when you meet her in the Great Forest."},{"name":"Meese","star":"Chihi","howToRecruit":"Speak to him in the blacksmith at the Village of the Dwarves. Maas must be recruited."},{"name":"Valeria","star":"Tensyo","howToRecruit":"Joins automatically before going to the Village of the Dwarves."},{"name":"Templeton","star":"Chimou","howToRecruit":"Speak to him at the Village of the Elves after it is destroyed."},{"name":"Kuromimi","star":"Chitan","howToRecruit":"Joins automatically before the major battle with Kwanda Rossman."},{"name":"Sanchez","star":"N/A","howToRecruit":"Joins automatically before the major battle with Kwanda Rossman."},{"name":"Humphrey Mintz","star":"Tenyu","howToRecruit":"Joins automatically before the major battle with Kwanda Rossman."},{"name":"Kwanda Rosman","star":"Tenmou","howToRecruit":"After defeating him, mention that there is something wrong with him. Choose to recruit him.\nNote: Do not agree to execute him at any time."},{"name":"Stallion","star":"Tensoku","howToRecruit":"Joins automatically after defeating Kwanda Rosman."},{"name":"Sylvina","star":"Chisatsu","howToRecruit":"Joins automatically after defeating Kwanda Rosman."},{"name":"Fu Su Lu","star":"Tensatsu","howToRecruit":"Speak to him in the Inn at the Kobold Village. Pay 10,000 bits for the food he has eaten."},{"name":"Gon","star":"Chikaku","howToRecruit":"Speak to him in his house at Kobold Village with Kuromimi in the active party."},{"name":"Rubi","star":"Chisoku","howToRecruit":"Speak to him in the Inn at Kobold Village with Kirkis in your party. Kirkis must be at least Level 35."},{"name":"Apple","star":"Chifuku","howToRecruit":"Speak to her in Mathiu's house at Seika after defeating Kwanda Rosman. Tell her that Mathiu wanted to help you.\nCastle Level 2"},{"name":"Flik","star":"Tenan","howToRecruit":"After he storms out of the HQ, follow him to Kaku. He will agree to join forces with you."},{"name":"Chapman","star":"Chiyu","howToRecruit":"Speak to him in the Armor Shop at Antei. Allow him to join you. He won't ask unless your Castle is at least Level 2."},{"name":"Eikei","star":"Chiyu","howToRecruit":"Speak to him at Teien with Tir at Level 40 or higher and Castle Level 2 or higher."},{"name":"Hellion","star":"Chisyu","howToRecruit":"Speak to her in the Inn/Item Shop at Teien. Allow her to join you. She won't ask unless your Castle is at least Level 2."},{"name":"Jabba","star":"Chisei","howToRecruit":"Speak to him in the Appraisal Shop at Rikon with a Nameless Urn in your inventory."},{"name":"Jeane","star":"Chiketsu","howToRecruit":"Speak to her in the Rune Shop at Antei. Allow her to join you. If your Castle is not large enough she will tell you to get more recruits.\nCastle Level 3"},{"name":"Lotte","star":"Chiku","howToRecruit":"Speak to her in the Inn at Rikon. Agree to find her cat. Go to Kaku and capture the cat just outside the Inn. Return it to her. She will not ask for your help unless your Castle level is high enough.\nCastle Level 3"},{"name":"Mina","star":"Chiin","howToRecruit":"Speak to her in the Inn at Antei. Agree to dance with her.\nNote: Tir must be equipped with Toe Shoes."},{"name":"Anji","star":"Tenken","howToRecruit":"Speak to him at the Pirate's Hideout with a level 3 castle and both Tai Ho and Yam Koo in your active party. Agree to fight him, Kanak, and Leonardo. Beat them within five rounds."},{"name":"Kanak","star":"Tenzai","howToRecruit":"Joins with Anji."},{"name":"Leonardo","star":"Tenpai","howToRecruit":"Joins with Anji."},{"name":"Gen","star":"Chiman","howToRecruit":"Joins automatically after agreeing to help you cross the rapids."},{"name":"Kamandol","star":"Chiri","howToRecruit":"Joins automatically after agreeing to help you cross the rapids."},{"name":"Kimberley","star":"Chikou","howToRecruit":"Joins automatically after agreeing to help you enter Soniere Prison."},{"name":"Tesla","star":"Chibun","howToRecruit":"Joins automatically after agreeing to help you enter Soniere Prison."},{"name":"Esmeralda","star":"Chikai","howToRecruit":"Speak to her in the Inn at Antei with an Opal in your inventory."},{"name":"Liukan","star":"Chirei","howToRecruit":"Joins automatically after saving him from Soniere Prison."},{"name":"Milich Oppenheimer","star":"Tenkyu","howToRecruit":"After defeating him, say that he is not at fault for killing Gremio.\nNote: Do not agree with Pahn, Cleo, and Viktor about avenging Gremio."},{"name":"Ivanov","star":"Chiyu","howToRecruit":"Speak with him at Scarleticia Castle after defeating Milich."},{"name":"Kasios","star":"Chiraku","howToRecruit":"Speak to her at Scarleticia Castle with Milich in your active party."},{"name":"Qlon","star":"Chiken","howToRecruit":"Speak with him at Antei after defeating Milich and your Castle is at least Level 3."},{"name":"Kasumi","star":"Chikyu","howToRecruit":"Joins automatically before the first battle with Teo McDohl's army."},{"name":"Georges","star":"Chisatsu","howToRecruit":"Speak to him in the Inn at Kirov. Beat the record for any number of matches. Will not appear unless Castle is at least Level 3."},{"name":"Lester","star":"Chizou","howToRecruit":"In Kirov, enter the houses to the left and right of Sarah and taste the stew on the stove. Then enter the house south of Sarah and talk to him. Will not appear unless Castle is at least Level 3."},{"name":"Sarah","star":"Chisou","howToRecruit":"1: Speak to her in Kirov and listen to her request (won't ask if your Castle isn't at least Level 3)\n2: Purchase some Sugar at the Item Shop.\n3: Give the sugar to the villager at the Inn for a Yardstick.\n4: Give the Yardstick to the villager south of Sarah for some Salt.\n5: Give the Salt to the villager at the Item Shop for some Soy Sauce.\n6: Give the Soy Sauce to the villager at the Armor Shop for some Soap.\n7: Give the Soap to Sarah."},{"name":"Blackman","star":"Chitou","howToRecruit":"Speak to him at Kalekka without stepping on his plants.\nNote: If you step on his plants before speaking to him, simply exit the village and return."},{"name":"Kage","star":"Teni","howToRecruit":"Speak to him at the Secret Factory and pay his 20,000 bit fee."},{"name":"Kessler","star":"Chisin","howToRecruit":"Speak to him at the Secret Factory."},{"name":"Ledon","star":"Chido","howToRecruit":"Speak to him at the Secret Factory."},{"name":"Melodye","star":"Chisa","howToRecruit":"Speak to her at Kirov with the Sound Rune in your inventory."},{"name":"Kun To","star":"Tenfu","howToRecruit":"Joins automatically after agreeing to lend boats to Tai Ho."},{"name":"Mose","star":"Chiziku","howToRecruit":"Joins automatically before delivering the Fire Spears."},{"name":"Ronnie Bell","star":"Chiaku","howToRecruit":"Joins automatically before delivering the Fire Spears."},{"name":"Alen","star":"Chimou","howToRecruit":"Joins automatically after defeating General Teo."},{"name":"Grenseal","star":"Chiki","howToRecruit":"Joins automatically after defeating General Teo."},{"name":"Kirke","star":"Chihei","howToRecruit":"Speak to him at Fort Lorimar and ask him to join."},{"name":"Marco","star":"Chitai","howToRecruit":"Speak to him at the Warrior's Village and win 5,000 bits from him."},{"name":"Moose","star":"Chikyou","howToRecruit":"Speak to him in the weapon shop at the Warrior's Village with Maas, Meese, and Mose in your active party."},{"name":"Zen","star":"Chikei","howToRecruit":"Speak to him behind Qlon Temple with the Red, Blue, and Yellow Flower Seeds in your inventory. He won't ask if your Castle isn't at least Level 3."},{"name":"Morgan","star":"Chian","howToRecruit":"Speak to him at Qlon Temple if your Castle is at least Level 3 and allow him to join the army, otherwise he will say he needs more training."},{"name":"Quincy","star":"Chiyu","howToRecruit":"Speak to him at the Garan Fortress with at least 80 recruits (dead and \"away\" characters don't count)."},{"name":"Fukien","star":"Chijyu","howToRecruit":"Joins automatically after entering Qlon Temple."},{"name":"Hugo","star":"Chisui","howToRecruit":"Speak to him at the Qlon Temple with the War Scroll in your inventory. He will not accept it unless your Castle is at least Level 3."},{"name":"Window","star":"Chisu","howToRecruit":"Speak to him in the Item Shop at Warrior's Village with the Window Rune in your inventory. He won't ask unless your Castle is at least Level 3."},{"name":"Hix","star":"Tenrou","howToRecruit":"Joins automatically before entering Neclord's Castle."},{"name":"Tengaar","star":"Tensui","howToRecruit":"Joins automatically after saving her from Neclord's Castle."},{"name":"Clive","star":"Tensyo","howToRecruit":"Speak to him in the Inn at Rikon with a level 4 HQ. Ask him to join the army.\nNote: Clive's appearance in the Inn is random. Enter and exit the town until you find him."},{"name":"Crowley","star":"Chizen","howToRecruit":"Speak to him in the [Cave of the Past] with a level 4 HQ. There is a secret passage that will lead to him in the third level of the cave."},{"name":"Pesmerga","star":"Teni","howToRecruit":"Speak to him on the top floor of Neclord's Castle with a level 4 HQ. Ask him to join the army."},{"name":"Leon Silverberg","star":"Chikai","howToRecruit":"Speak to him in the house at Kalekka. He will mention how impressive the Liberation Army has become. Speak to Mathiu at HQ and receive a letter. Deliver the letter to Leon.\nNote: If you wish to resurrect Gremio, this is the latest time you can recruit Leon-- receive the letter either the night before the mission at Moravia Castle or before the first major battle with Sonya Shulen's Army. Receiving the letter by the latter method will require you to make delivery immediately after the major battle at Shasarazade, before moving close to the entrance of Shasarazde's dungeon area."},{"name":"Fuma","star":"Chikou","howToRecruit":"Speak to him at the Dragon Knights' Fortress. Allow him to join the party.\nNote: He is at the upper-right of the first screen of the fortress and will not appear unless your Castle is at least Level 3."},{"name":"Kreutz","star":"Tenku","howToRecruit":"Speak to him at the Dragon Knights' Fortress with Humphrey in the active party."},{"name":"Milia","star":"Chii","howToRecruit":"Joins automatically before heading to Seek Valley."},{"name":"Futch","star":"Chibi","howToRecruit":"Joins automatically after returning from Seek Valley."},{"name":"Joshua Levenheit","star":"Chikyou","howToRecruit":"Joins automatically after returning from Seek Valley."},{"name":"Taggart","star":"Chima","howToRecruit":"Joins automatically after returning from Seek Valley."},{"name":"Mace","star":"Chiko","howToRecruit":"Speak to him at Seek Valley with Maas, Meese, Moose, and Mose in your active party and have a level 4 HQ.\nNote: Mace can only be recruited the night before the mission at Moravia Castle and before completeing the mission at Shasarazade."},{"name":"Griffith","star":"Tenritsu","howToRecruit":"After defeating him at the Northern Checkpoint, he will automatically join."},{"name":"Kasim Hazil","star":"Tenyu","howToRecruit":"Joins automatically after saving Warren and Viktor from Moravia Castle."},{"name":"Warren","star":"Tenki","howToRecruit":"Joins automatically after saving him and Viktor from Moravia Castle."},{"name":"Vincent","star":"Chichin","howToRecruit":"After saving Warren and Viktor, speak to him on the top floor of Moravia Castle."},{"name":"Maximillian","star":"Chii","howToRecruit":"After saving Warren and Viktor, enter the Northern Checkpoint and allow him to join the Liberation Army."},{"name":"Sancho","star":"Chiei","howToRecruit":"Joins with Maximillian."},{"name":"Sonya Schulen","star":"Tenjyu","howToRecruit":"After the mission at Shasarazade, speak to her in the dungeon at HQ. Request her assistance."}]